Repository: NeuralNinjas-AI/AirQuality
Catalog: Datasets/archive/ELRC_417_Parallel texts from Swedish Work environment/ELRC_417_Parallel texts from Swedish Work environment [...]_dataset/261.en-ro.tmx
Source language: en
Languages: ro

source: Foreign companies that post employees to work in Sweden for more than five days are required to notify this to the Swedish Work Environment Authority.
ro: Indiferent de forma de angajare sau de condiția, naționalitatea sau etnicitatea lucrătorului, fiecare are același drept la un loc de muncă sigur și sănătos.

source: Areas covered by posted workers’ rights are: working environment, minimum wages and holiday pay, regulations on working hours, workplace discrimination and parental leave.
ro: Domeniile acoperite de drepturile lucrătorilor detașați sunt: mediul de muncă, salariile minime și concediul plătit și reglementările referitoare la orele de lucru, discriminarea la locul de muncă și concediul patern/matern.

source: Regarding taxes and social benefits, there are different regulations for foreign workers depending on their situation.
ro: Cu privire la impozitele și ajutoarele sociale, există reglementări diferite pentru lucrătorii străini, în funcție de situația lor.

source: More information can be found at www.av.se/posting applies to foreign employers, both inside and outside the EU.
ro: Mai multe informații pot fi găsite la pagina de webb www.av.se/posting tatea Mediului de Muncă din Suedia.

source: The employer is also required to appoint a contact person in Sweden.
ro: Angajatorul este de asemenea obligat să desemneze o persoană de contact person în Suedia.

source: This person must be able to show documentation that proves that the laws covering posting in Sweden are complied with, for example a valid employment contract.
ro: Această persoană trebuie să aibă posibilitatea să prezinte documentație care dovedește că legile care acoperă detașarea în Suedia sunt respectate - de exemplu un contract de angajare valabil.

source: The Swedish Work Environment Authority is a government agency.
ro: Autoritatea Mediului de Muncă din Suedia este o agenție guvernamentală.

source: We ensure that legislation concerning working environment and working hours is followed.
ro: Noi asigurăm respectarea legislație referitoare la condițiile de muncă și orele de lucru.

source: Hazardous working conditions, or working conditions that are not consistent with the laws and regulations, should be reported first of all to the employer.
ro: Condiții periculoase de muncă sau condiții de muncă care nu corespund cu legile și regulamentele, ar trebui raportate în primul rând angajatorului.

source: They can then also be reported to the safety officer at the workplace or directly to us at the Swedish Work Environment Authority.
ro: Ele mai pot fi raportate la inspectorul de siguranță sau direct la noi la Autoritatea Mediului de Muncă din Suedia.
